// بالنسبه لل PostCss  هو المحرك او المسئول الاساسى عن تحويل وتشغيل كود ال css  قبل ما يوصل للمتصح
// وهتعتبره عباره عن برنامج كبير وبنضيف فيه بعض الاضافات زى tailwindcss , autoprefixer  وعرفنا هما بيع
// ملو اى بالظبط وفى حاجات تانيه ممكن نضيفها للبرنامج الكبير اللى هو PostCss  ممكن نضيفله 
//  postcss-import  الاضافه او ال  plugin  ده بيسمحلك انك تكتب او تعمل  import  لملف css  داخل ملف css  
//  برضه لكن ركز لأن ال  import داخل ملف  css  غير ملف js  لأن بتاعة ال js  بتحتاج تكتب فى ال src  اللى جوه
// تاج ال script  اللى بيكون فى اسفل ال  body  بنحتاج نكتب  src="module" انما ال import  بتاعت css  لأ دى تح
// تاج اضافه لل PostCss  زى الاضافه اللى لسه ذاكرينها فوق دى

// ملحوظة مهمة جدا
//  احنا لو كتبنا import  داخل ملف css  هتشتغل من غير الاضافه اللى ذاكرينها فوق لكن الاضافه بتحسن الوضع 
// وبتخلى ال Postcss  يشوف اى ملف css  ويحمله او يدمجه فى ملف ال global.css  بحيث المتصفح يطلب او يعمل 
//  request  واحد وخلاص انما بدون الاضافه دى كده المتصفح كل ما يشوف ملف css هيروج يعمل request  مخصوص ليه 
//  وده طبعا بيضيع ال performance


export default {
  plugins: {
    // دى اضافه مهمتها انها بتفك كل الكلاسات بتاعة تالويند وهى اللى بتهندل كود تالويند
    tailwindcss: {},
    // دى اضافة اللى بتضيف ال prefix  اللى هو  -moz -webkit  عشان بس يكون متوافق مع كل المتصفحات
    autoprefixer: {},
  },
}
